(lldb) target create "XXXX"
Current executable set to 'XXXX' ($ARCH).
(lldb) command source -s 0 'XXXX'
Executing commands in 'XXXX'.
(lldb) settings set target.disable-aslr false
(lldb) settings set stop-disassembly-display never
(lldb) command script import ./lldb_test.py
(lldb) create caml_start_program
Breakpoint created for regex caml_start_program.
(lldb) create caml_program
Breakpoint created for regex caml_program.
(lldb) create camlMeander[.$]c_to_ocaml*
Breakpoint created for regex camlMeander[.$]c_to_ocaml*.
(lldb) create ocaml_to_c
Breakpoint created for regex ocaml_to_c.
(lldb) run
Process XXXX launched: 'XXXX' ($ARCH)
Process XXXX stopped
* thread #1, queue = 'XXXX', stop reason = breakpoint 1.1
    frame #0: 0x00000000000000 meander`caml_start_program
Target 0: (meander) stopped.
(lldb) backtrace
frame X: meander`caml_start_program
frame X: meander`caml_startup_common
frame X: meander`caml_startup
frame X: meander`caml_main
frame X: meander`main
frame X: dyld`start
(lldb) continue
Process XXXX resuming
Process XXXX stopped
* thread #1, queue = 'XXXX', stop reason = breakpoint 2.1
    frame #0: 0x00000000000000 meander`caml_program
Target 0: (meander) stopped.
(lldb) backtrace
frame X: meander`caml_program
frame X: meander`caml_start_program
frame X: meander`caml_startup_common
frame X: meander`caml_startup
frame X: meander`caml_main
frame X: meander`main
frame X: dyld`start
(lldb) continue
Process XXXX resuming
Process XXXX stopped
* thread #1, queue = 'XXXX', stop reason = breakpoint 4.1
    frame #0: 0x00000000000000 meander`ocaml_to_c(unit=1) at meander_c.c:XX
   2   	#include <caml/callback.h>
   3
   4   	value ocaml_to_c (value unit) {
-> 5   	    caml_callback(*caml_named_value
    	                   ^
   6   	                  ("c_to_ocaml"), Val_unit);
   7   	    return Val_int(0);
   8   	}
Target 0: (meander) stopped.
(lldb) backtrace
frame X: meander`ocaml_to_c
frame X: meander`caml_c_call
frame X: meander`camlMeander$omain
frame X: meander`camlMeander$entry
frame X: meander`caml_program
frame X: meander`caml_start_program
frame X: meander`caml_startup_common
frame X: meander`caml_startup
frame X: meander`caml_main
frame X: meander`main
frame X: dyld`start
(lldb) continue
Process XXXX resuming
Process XXXX stopped
* thread #1, queue = 'XXXX', stop reason = breakpoint 3.1
    frame #0: 0x00000000000000 meander`camlMeander$c_to_ocaml
Target 0: (meander) stopped.
(lldb) backtrace
frame X: meander`camlMeander$c_to_ocaml
frame X: meander`caml_start_program
frame X: meander`caml_callback_exn
frame X: meander`caml_callback
frame X: meander`ocaml_to_c
frame X: meander`caml_c_call
frame X: meander`camlMeander$omain
frame X: meander`camlMeander$entry
frame X: meander`caml_program
frame X: meander`caml_start_program
frame X: meander`caml_startup_common
frame X: meander`caml_startup
frame X: meander`caml_main
frame X: meander`main
frame X: dyld`start
(lldb) quit
